Jakes-Fu/ZW217_W19_V4.1_yisai/MS_Customize/source/product/driver/wifi/rtl8723/rtl8723_wifi_adapter.c
#if 1

//#include "os.h"
#include "ms_customize_trc.h"
#include "usblist.h"
#include "rtl8723_wifi_adapter.h"

#include "os_api.h"
#include "tb_drv.h"
#include "tb_comm.h"
//#include "os_function_if.h"
#include "in_message.h"
#include "tcpip_types.h"
#include "tcpip_api.h"
#include "app_tcp_if.h"
#include "wifisupp_api.h"
#include "wifi_drv.h"

#if defined (PLATFORM_SC6530) || defined(PLATFORM_SC6531) || defined(PLATFORM_SC6531EFM) || defined(PLATFORM_UWS6121E)
#include "priority_system.h"
#endif


typedef struct
{
    int(*wifi_support_iperf_func)(void);
} RTL_PRIV_IPERF_T;

int SPI_CARD_DEFAULT_CLOCK = 24000000;
extern RTL_PRIV_OPS_T rtw_priv_ops;
extern RTL_PRIV_IPERF_T rtw_priv_iperf_ops;
extern int32 SCI_MEMCMP(void * _BUF1, void * _BUF2, uint32 _SIZE);

RTL_PRIV_OPS_T *p_rtl8723_priv_ops = &rtw_priv_ops;
RTL_PRIV_IPERF_T *p_rtl8723_priv_iperf_ops = &rtw_priv_iperf_ops;

/****************************************************************************/
//Description : to send signal to app
//Global resource dependence : 
//Author: juan.zhang
//Note: 
/****************************************************************************/
PUBLIC void SUPPMAIN_NotifyApp(
                            uint32      msg_id, 
                            void        *msg_info_ptr
                             );

/**---------------------------------------------------------------------------*
 **                         Time adapter functions                                                                           *
 **---------------------------------------------------------------------------*/

void rtlwifi_sleep_time(os_time_t sec, os_time_t usec)
{
#if 0
    if (sec || usec)
        SCI_Sleep(sec*1000+usec/1000);
#endif
}

int rtl_get_time(struct rtl_os_time *t)
{
    unsigned int res = 0;

    res = SCI_GetTickCount();
    t->sec = res/1000;
    t->usec = (res%1000)*1000;
   
    return res;
}

unsigned int rtl_getSystemTickCount(void)
{
    return SCI_GetTickCount();
}

/**---------------------------------------------------------------------------*
 **                         Memory adapter  functions                                                                     *
 **---------------------------------------------------------------------------*/

void * rtl_zalloc(unsigned int size)
{
    void* ptr = 0;
    ptr = SCI_ALLOCA(size);
    if (ptr != 0)
    {
        SCI_MEMSET(ptr,0,(size_t)size);
    }
    return ptr;
}


void * rtl_malloc(unsigned int size)
{
    void* ptr = 0;
    ptr = SCI_ALLOCA(size);
    if (ptr != 0)
    {
        SCI_MEMSET(ptr,0,(size_t)size);
    }
    return ptr;
}


void * rtl_realloc(void *ptr, unsigned int size)
{
       void *temp = SCI_ALLOCA(size);

    if (temp != 0)
    {
        SCI_MEMCPY(temp, ptr, (size_t)size);
    }
    
    SCI_FREE(ptr);

    return temp;
}

void rtl_free(void *ptr)
{
     if(ptr == NULL)
        return;
     SCI_FREE(ptr);
}


void * rtl_memcpy(void *dest, const void *src, size_t n)
{
    SCI_MEMCPY(dest,src,n);

    return dest;
}

int rtl_memcmp(const void*  dest,const void*  src,size_t  count)   
 {   

    return memcmp(dest,src,count);
}   


int rtl_memcpy_to_user(void *dest, void *src, unsigned int count)
{
#if 0
    if(count)
    {
        SCI_MEMCPY(dest,src,count);
        return 0;
    }
#endif
    return 1;
}

void *rtl_malloc_debug(unsigned int size,const char * file,unsigned int line)
{
    return 0;
    //return SCI_Malloc(size,file,line);
}


/**---------------------------------------------------------------------------*
 **                         OS   adapter functions                                                                           *
 **---------------------------------------------------------------------------*/


void rtl_sleep_ms(unsigned int msecs)
{
    SCI_Sleep(msecs);
}


extern uint32 OS_TickDelay(uint32 ticks);
void rtl_delay_ms(unsigned int time)
{
        if (SCI_InThreadContext()) 
        {
            SCI_Sleep(time);
        } 
        else 
        {
            OS_TickDelay(time);
        }
}

void rtl_delay_us(unsigned int us)
{
   uint32 l,m,k;
   k = CHIP_GetArmClk()/ARM_CLK_13M;
   for (l = 0; l < us; l++) 
   {
     m = k; 
     while(m--){ };
   }
}
 
int rtl_memset(void *dest, int value, unsigned int len)
{
    if (dest != 0 && len != 0)
    {
        SCI_MEMSET(dest,value,(size_t)len);
    }
    return TRUE;
}

void rtl_init_listhead(struct list_head *list)
{
    _INIT_LIST_HEAD(list);
}

uint32 rtl_is_list_empty(struct list_head *phead)
{
    if (list_empty(phead))
        return TRUE;
    else
        return FALSE;
}

void rtl_list_insert_tail(struct list_head *plist, struct list_head *phead)
{
    list_add_tail(plist, phead);
}

void rtl_list_delete(struct list_head *plist)
{
    list_del_init(plist);
}

RTL_SCI_SEMAPHORE_PTR rtl_createSemaphore(char* pName, unsigned int count)
{
    return SCI_CreateSemaphore(pName,count );

}

unsigned int rtl_getSemaphore(RTL_SCI_SEMAPHORE_PTR pSem,unsigned int option)
{
        if (pSem == NULL)
            return SCI_ERROR;
    return SCI_GetSemaphore ( pSem, option);
}

unsigned int rtl_putSemaphore(RTL_SCI_SEMAPHORE_PTR pSem)
{
    if (pSem == NULL)
        return SCI_ERROR;
    
    return SCI_PutSemaphore(pSem);
}

void rtl_freeSemaphore(RTL_SCI_SEMAPHORE_PTR pSem)
{
    if(pSem == NULL)
        return;
    SCI_DeleteSemaphore(pSem);
}

/* based on spectrum tcp/ip doc, tcp/ip priority is 18, so we should
  * higher priority in driver for some thread */
RTL_BLOCK_ID rtl_createThread(
    const char  *thread_name,           
    const char  *queue_name,            
    void    (*entry)(uint32, void*),    
    uint32  argc,                       
    void    *argv,                      
    uint32  stack_size,                 
    uint32  queue_num,   
    RTL_ADAP_TASK_PRIO_E  para_priority,    
    uint32  preempt,     
    uint32  auto_start   
    )
{
    uint32 priority = 0;
    
    switch(para_priority)
    {
     case RTL_ADAP_TASK_PRIO_1:
#if defined (PLATFORM_SC6530) || defined(PLATFORM_SC6531) || defined(PLATFORM_SC6531EFM) || defined(PLATFORM_UWS6121E)
     priority = PRI_RTL_HIGH_TASK;
#else
     priority = 17;
#endif        
     break;

     case RTL_ADAP_TASK_PRIO_2:
#if defined (PLATFORM_SC6530) || defined(PLATFORM_SC6531) || defined(PLATFORM_SC6531EFM) || defined(PLATFORM_UWS6121E)
     priority = PRI_RTL_NORMAL_TASK; //PRI_RTL_NORMAL_TASK;
#else
     priority = 26;
#endif        
     break;

     case RTL_ADAP_TASK_PRIO_3:
        priority = 27;
     break;

     case RTL_ADAP_TASK_PRIO_4:
        priority = 29;
     break;

        default:
        priority = 29;
        break;
    }

