Jakes-Fu/ZW217_W19_V4.1_yisai/MS_Customize/source/product/driver/wifi/rtl8723/rtl8723_wifi_adapter.c
   SCI_TRACE_LOW("&&&&&&&&rtl_createThread(): priority is %d\n",priority);
   return SCI_CreateAppThread(thread_name,queue_name,entry,argc,argv,stack_size,queue_num,priority,preempt,auto_start);
}

void rtl_deleteThread(BLOCK_ID thread_id)
{
    if (thread_id != SCI_INVALID_BLOCK_ID)
    SCI_DeleteThread(thread_id);
}
void rtl_exitThread(void)
{
    SCI_ThreadExit();
}

unsigned int rtl_suspendThread(RTL_BLOCK_ID    threadID)
{
    return SCI_SuspendThread(threadID);
}

unsigned int rtl_resumeThread(RTL_BLOCK_ID    threadID)
{
    return SCI_ResumeThread(threadID);
}

rtl_xSignalHeader rtl_getSignal(RTL_BLOCK_ID threadId)
{
    return 0;
    //return (para_xSignalHeader)SCI_GetSignal(threadId);

}

unsigned int rtl_sendSignal(rtl_xSignalHeader   pSignal, RTL_BLOCK_ID threadId)
{
        return 0;
#if 0
    if (SCI_SUCCESS == SCI_IsThreadQueueAvilable(threadId))
        return SCI_SendSignal(pSignal,threadId);
    else
        return SCI_ERROR;
#endif
}

void *rtl_createTimer(
    const char  *timer_name,    // Name string of the timer
    RTL_TIMER_FUN   timer_fun,      // Timer callback function
    uint32      input,          // Input value for timer callback function 
    uint32      timer_expire,   // Specifies the timer expire value in     
                                // milliseconds.                           
    uint32      auto_activate   // Option to check if auto active the timer
)
{
    return SCI_CreateTimer(timer_name,timer_fun,input,timer_expire,auto_activate);
}

uint32 rtl_changeTimer(RTL_TIMER_PTR timer_ptr,RTL_TIMER_FUN timer_fun,uint32 timer_expire) 
{
    if (timer_ptr)
        return SCI_ChangeTimer(timer_ptr,timer_fun,timer_expire);
    else
        return FALSE;
}

uint32 rtl_activeTimer(RTL_TIMER_PTR timer_ptr)
{
    if (timer_ptr)
        return SCI_ActiveTimer(timer_ptr);
    else
        return FALSE;
}

unsigned int rtl_deactiveTimer(RTL_TIMER_PTR timer_ptr)
{
    if (timer_ptr)
        return SCI_DeactiveTimer(timer_ptr);
    else
        return FALSE;
}

uint32 rtl_deleteTimer(RTL_TIMER_PTR timer_ptr)
{
    if (timer_ptr)
        return SCI_DeleteTimer(timer_ptr);
    else
        return SCI_PTR_ERROR;
}

int RTL_LOGGING_DEFAULT_LEVEL = RTL_LOGGING_LEVEL_NORMAL;

RTL_SCI_MUTEX_PTR rtl_createMutex(const char* pName,unsigned int priority)
{
    return SCI_CreateMutex(pName,priority);
}

unsigned int rtl_getMutex(RTL_SCI_MUTEX_PTR pMutex,unsigned int option )
{
    if (SCI_InThreadContext())
        return SCI_GetMutex(pMutex,option);
    else
        return TRUE;
}

unsigned int rtl_putMutex(RTL_SCI_MUTEX_PTR pMutex)
{
    if (SCI_InThreadContext())
        return SCI_PutMutex(pMutex);
    else
        return TRUE;
}

unsigned int rtl_deleteMutex(RTL_SCI_MUTEX_PTR pMutex)
{
    if(pMutex == NULL)
        return SCI_SUCCESS;
    return SCI_DeleteMutex(pMutex);
}


RTL_EVENT_GROUP_PTR rtl_createEvent(char *pName)
{
    return SCI_CreateEvent(pName);
}

uint32 rtl_setEvent(SCI_EVENT_GROUP_PTR pGroup, uint32 flags,uint32 option )
{
    if (pGroup == NULL)
        return SCI_ERROR;
    
    return SCI_SetEvent(pGroup,flags,option);
}

uint32 rtl_getEvent(SCI_EVENT_GROUP_PTR pGroup, uint32 flags,uint32 getOption,uint32 *pActualFlags, uint32 waitOption)
{
    if (pGroup == NULL)
        return SCI_ERROR;
    
    return SCI_GetEvent(pGroup,flags,getOption,pActualFlags,waitOption);
}

uint32 rtl_deleteEvent(SCI_EVENT_GROUP_PTR pGroup)
{
    if(pGroup == NULL)
        return SCI_SUCCESS;
    return SCI_DeleteEvent(pGroup);
}

/**---------------------------------------------------------------------------*
 **                         TCPIP adapter functions                                                                         *
 **---------------------------------------------------------------------------*/

/****************************************************************************/
//Description : wifi on
//Global resource dependence :
//Author: juan.zhang
//Note:
/****************************************************************************/
BOOLEAN rtl8723_SetMAC(unsigned char *maddr)
{
    uint32 ret;
    WIFI_ADDR_T mac = {0};
    unsigned char *pmac;
    unsigned char mac_zero[WIFI_NV_ADDR_LEN] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
    
    ret = WIFI_GetNvParam (&mac, NULL);
    pmac = mac.address;
    if (ret != WIFI_RET_OK || pmac[0] == 0xff || rtl_memcmp (pmac, mac_zero, WIFI_NV_ADDR_LEN) == 0 ||
        rtl_memcmp (pmac, maddr, WIFI_NV_ADDR_LEN) != 0) {
#if 0
        /* Set to default value */
        srand (SCI_GetTickCount ());        
        pmac[0] = 0x00;
        pmac[1] = 0xe0;
        pmac[2] = 0x4c;
        pmac[3] = (unsigned long)rand() & 0xff;
        pmac[4] = (unsigned long)rand() & 0xff;
        pmac[5] = (unsigned long)rand() & 0xff;
#else
     rtl_memcpy(pmac, maddr, WIFI_NV_ADDR_LEN);
#endif
        /* Save to NV RAM */
        WIFI_SaveNvParam (&mac, NULL);

     SCI_TraceLow("MAC ADDR =   %02X:%02X:%02X:%02X:%02X:%02X\n",
            maddr[0], maddr[1], maddr[2], maddr[3], maddr[4], maddr[5]);
    }   
    
    return TRUE;
}

/* we should call this function when driver init to regsiter net to
 * TCP/IP stack, we will get a net_id form this function,
 * and we also register pkt xmit function: tx_req_fptr */
RTL_TCPIP_NET_ID_T rtl_tcpipRegNetInterface(RTL_TCPIP_NETIF_CFG_T* pConfig)
{
    TCPIP_NETIF_CFG_T config;

    if (pConfig == 0)
    {
        return 0;
    }
    rtl_memset(&config, 0, sizeof(TCPIP_NETIF_CFG_T));
    
    config.pkt_type = (TCPIP_PACKET_TYPE_E)pConfig->pkt_type;
    config.tx_req_fptr = (TCPIP_TX_REQ_FPTR)pConfig->tx_req_fptr;
    config.is_async_tx = pConfig->is_async_tx;
    //config.saddr = pConfig->saddr;
    config.saddr.ipaddr = pConfig->saddr.ipaddr;
    config.saddr.snmask = pConfig->saddr.snmask;
    config.saddr.gateway = pConfig->saddr.gateway;
    config.saddr.dns1 = pConfig->saddr.dns1;
    config.saddr.dns2 =pConfig->saddr.dns2;
    
    config.haddr.addr_ptr= pConfig->haddr.addr_ptr;
    config.haddr.addr_len= pConfig->haddr.addr_len;

   
