Jakes-Fu/ZW217_W19_V4.1_yisai/MS_Customize/source/product/driver/wifi/rtl8723/rtl8723_wifi_adapter.c
    config.mtu = pConfig->mtu;
    config.tx_rate = pConfig->tx_rate;
    config.rx_flctrl_fptr = pConfig->rx_flctrl_fptr;
    config.netif_name_ptr = pConfig->netif_name_ptr;

    /* Save to NV RAM */
    rtl8723_SetMAC(config.haddr.addr_ptr);
    
    return TCPIP_RegNetInterface(&config);
}

/* we should call this function in driver deinit to
 * deregsiter net_id from TCP/IP stack */
void rtl_TCPIP_DeregNetInterface(RTL_TCPIP_NET_ID_T net_id)
{
    TCPIP_DeregNetInterface(net_id);
}

/* this function used for indicate pkt to TCP/IP */
RTL_TCPIP_ERROR_E rtl_tcpipRX(RTL_TCPIP_PACKET_INFO_T* pPacket)
{  
    TCPIP_PACKET_INFO_T packet;

    rtl_memset(&packet, 0, sizeof(TCPIP_PACKET_INFO_T));
    packet.data_ptr = pPacket->data_ptr;
    packet.data_len = pPacket->data_len;
    packet.net_id = pPacket->net_id;

    return (RTL_TCPIP_ERROR_E)TCPIP_RxInd(&packet);
}

void rtl8723_supp_notifyOnCnf(const RTL_WIFISUPP_ON_RESULT_T *pResult)
{
    RTL_WIFISUPP_ON_RESULT_T result ;
    int i = 0;

    if (pResult == 0)
    {
        return;
    }

    SCI_TRACE_LOW("======>rtl8723_supp_notifyOnCnf result=%d, pResult->net_id is 0x%x", pResult->wifi_on_result, pResult->net_id);

    rtl_memset(&result, 0, sizeof(RTL_WIFISUPP_ON_RESULT_T));
    result.wifi_on_result = (RTL_WIFISUPP_RESULT_E)pResult->wifi_on_result;
    result.net_id = pResult->net_id;
    result.is_support_roam = pResult->is_support_roam;
    //result.is_support_protocol = pResult->is_support_protocol;
    for (i = 0; i < WIFISUPP_ENCRYP_PROTOCOL_MAX; i++)
    {
        result.is_support_protocol[i] = pResult->is_support_protocol[i];
    }

    //result.is_support_eap = pResult->is_support_eap;
    for (i = 0; i < WIFISUPP_WPA_EAP_TYPE_MAX; i++)
    {
        result.is_support_eap[i] = pResult->is_support_eap[i];
    }

    //result.is_support_inner_eap = pResult->is_support_inner_eap;
    for (i = 0; i < WIFISUPP_INNER_CREDENTIAL_TYPE_MAX; i++)
    {
        result.is_support_inner_eap[i] = pResult->is_support_inner_eap[i];
    }

    SUPPMAIN_NotifyApp(WIFISUPP_SIG_ON_CNF, &result);
    SCI_TRACE_LOW("<=======rtl8723_supp_notifyOnCnf\n");
}

void rtl8723_supp_notifyOffCnf(const RTL_WIFISUPP_OFF_RESULT_T *pResult)
{
    RTL_WIFISUPP_OFF_RESULT_T result;

    if (pResult == 0)
    {
        return;
    }
    SCI_TRACE_LOW("WIFI para_supp_notifyOffCnf result=%d", pResult->wifi_off_result);
    rtl_memset(&result, 0, sizeof(RTL_WIFISUPP_OFF_RESULT_T));
    result.wifi_off_result = (RTL_WIFISUPP_RESULT_E)pResult->wifi_off_result;

    SUPPMAIN_NotifyApp(WIFISUPP_SIG_OFF_CNF, &result);
}

void rtl8723_supp_notifyConnectCnf(const RTL_WIFISUPP_CONNECT_RESULT_T *pResult )
{
        RTL_WIFISUPP_CONNECT_RESULT_T result ;

        if (pResult == 0)
        {
            return;
        }

        SCI_TRACE_LOW("WIFI para_supp_notifyConnectCnf result=%d", pResult->result);
        rtl_memset(&result, 0, sizeof(RTL_WIFISUPP_CONNECT_RESULT_T));
        result.result = (RTL_WIFISUPP_RESULT_E)pResult->result;
        //result.ssid = pResult->ssid;
        rtl_memcpy(result.ssid.ssid, pResult->ssid.ssid, sizeof(result.ssid.ssid));
        result.ssid.ssid_len = pResult->ssid.ssid_len;
        
        //result.bssid_info = pResult->bssid_info;
        rtl_memcpy(result.bssid_info.bssid, pResult->bssid_info.bssid, sizeof(result.bssid_info.bssid));
     result.channel = pResult->channel;
     result.rssi = pResult->rssi;

        SUPPMAIN_NotifyApp(WIFISUPP_SIG_CONNECT_CNF, &result);
}


void rtl8723_supp_notifyScanInd(const RTL_WIFISUPP_SCAN_AP_INFO_T*pScanInfo )
{
    RTL_WIFISUPP_SCAN_AP_INFO_T scan_info = {0};

    if (pScanInfo == 0)
    {
        return;
    }
    SCI_TRACE_LOW("WIFI para_supp_notifyScanInd");
    rtl_memset(&scan_info, 0, sizeof(RTL_WIFISUPP_SCAN_AP_INFO_T));
    //scan_info.ssid = pScanInfo->ssid;
    rtl_memcpy(scan_info.ssid.ssid, pScanInfo->ssid.ssid, sizeof(scan_info.ssid.ssid));
    scan_info.ssid.ssid_len = pScanInfo->ssid.ssid_len;
    
    //scan_info.bssid_info = pScanInfo->bssid_info;
    rtl_memcpy(scan_info.bssid_info.bssid , pScanInfo->bssid_info.bssid, sizeof(scan_info.bssid_info.bssid));
    
    scan_info.signal_qua = pScanInfo->signal_qua;
    scan_info.noise = pScanInfo->noise;
    scan_info.beacon_interval = pScanInfo->beacon_interval;
    scan_info.channel = pScanInfo->channel;
    scan_info.encryp_protocol = (RTL_WIFISUPP_ENCRYP_PROTOCOL_E)pScanInfo->encryp_protocol;
    scan_info.rate = pScanInfo->rate;
    scan_info.network_mode = (RTL_WIFISUPP_NETWORK_MODE_E)pScanInfo->network_mode;
    scan_info.credential_type = pScanInfo->credential_type;

    SUPPMAIN_NotifyApp(WIFISUPP_SIG_SCAN_IND, &scan_info);
}

void rtl8723_supp_notifyScanCnf(const RTL_WIFISUPP_RESULT_E *pResult)
{
    RTL_WIFISUPP_RESULT_E result = RTL_WIFISUPP_RESULT_SUCC;

    if (pResult == 0)
    {
        return;
    }

    SCI_TRACE_LOW("WIFI param_supp_notifyScanCnf");
    result = (RTL_WIFISUPP_RESULT_E)*pResult;

    SUPPMAIN_NotifyApp(WIFISUPP_SIG_SCAN_CNF, &result);
}

void rtl8723_supp_notifyDisconnectCnf(const RTL_WIFISUPP_DISCONNECT_RESULT_T *pDiscCnf)
{
    RTL_WIFISUPP_DISCONNECT_RESULT_T result ;

    if (pDiscCnf == 0)
    {
        return;
    }
    
    //SCI_TRACE_LOW:"WIFI param_supp_notifyDisconnectCnf result=%d"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_661_112_2_18_0_36_17_2223,(uint8*)"d", pDiscCnf->result);
    rtl_memset(&result, 0, sizeof(RTL_WIFISUPP_DISCONNECT_RESULT_T));
    result.result = (RTL_WIFISUPP_RESULT_E)pDiscCnf->result;
//    result.ssid = pDiscCnf->ssid;
    rtl_memcpy(result.ssid.ssid, pDiscCnf->ssid.ssid, sizeof(result.ssid.ssid));
    result.ssid.ssid_len = pDiscCnf->ssid.ssid_len;
    
    SUPPMAIN_NotifyApp(WIFISUPP_SIG_DISCONNECT_CNF, &result);
}

void rtl8723_supp_notifyDisconnectInd(const RTL_WIFISUPP_DISCONNECT_INFO_T *pDiscInd)
{
    RTL_WIFISUPP_DISCONNECT_INFO_T disc_ind;

    if (pDiscInd == 0)
    {
        return;
    }
    
    //SCI_TRACE_LOW:"WIFI param_supp_notifyDisconnectInd"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_680_112_2_18_0_36_17_2224,(uint8*)"");
    rtl_memset(&disc_ind, 0, sizeof(RTL_WIFISUPP_DISCONNECT_INFO_T));
//    disc_ind.ssid = pDiscInd.ssid;
    rtl_memcpy(disc_ind.ssid.ssid, pDiscInd->ssid.ssid, sizeof(disc_ind.ssid.ssid));
    disc_ind.ssid.ssid_len = pDiscInd->ssid.ssid_len;

    SUPPMAIN_NotifyApp(WIFISUPP_SIG_DISCONNECT_IND, &disc_ind);
}

void rtl8723_supp_notifyRssiChangedInd(const RTL_WIFISUPP_RSSI_CHANGED_INFO_T *pRssiInd)
{
    RTL_WIFISUPP_RSSI_CHANGED_INFO_T rssi_ind;

