Jakes-Fu/ZW217_W19_V4.1_yisai/MS_Customize/source/product/driver/wifi/rtl8723/rtl8723_wifi_adapter.c
    if (pRssiInd == 0)
    {
        return;
    }

    SCI_TRACE_LOW("###WIFI param_supp_notifyRssiChanged");
	rtl_memset(&rssi_ind, 0, sizeof(RTL_WIFISUPP_RSSI_CHANGED_INFO_T));
	rtl_memcpy(rssi_ind.ssid.ssid, pRssiInd->ssid.ssid, sizeof(rssi_ind.ssid.ssid));
	rssi_ind.ssid.ssid_len = pRssiInd->ssid.ssid_len;
	rtl_memcpy(rssi_ind.bssid_info.bssid, pRssiInd->bssid_info.bssid, sizeof(rssi_ind.bssid_info.bssid));
	rssi_ind.new_signal_qua= pRssiInd->new_signal_qua;
	SCI_TRACE_LOW("###WIFI param_supp_notifyRssiChanged mac=%02x:%02x:%02x:%02x:%02x:%02x\n",
		rssi_ind.bssid_info.bssid[0], rssi_ind.bssid_info.bssid[1], rssi_ind.bssid_info.bssid[2], rssi_ind.bssid_info.bssid[3], rssi_ind.bssid_info.bssid[4], rssi_ind.bssid_info.bssid[5]);
	SCI_TRACE_LOW("###WIFI param_supp_notifyRssiChanged ssid is %s, ssid_len is %d, new_rssi is %d",
		rssi_ind.ssid.ssid, rssi_ind.ssid.ssid_len, rssi_ind.new_signal_qua);

    SUPPMAIN_NotifyApp(WIFISUPP_SIG_RSSI_CHANGED_IND, &rssi_ind);
}

/**---------------------------------------------------------------------------*
 **                         Driver adapter functions                                                                         *
 **---------------------------------------------------------------------------*/

void rtl8723_gpioEnableIntCtl()
{
     //GPIO_EnableIntCtl (GPIO_WIFI_IRQ_ID);
 }

void rtl8723_gpioDisableIntCtl()
{
    //GPIO_DisableIntCtl(GPIO_WIFI_IRQ_ID);
}


//void para_getMac_from_NV(unsigned char* mac)
//{
    //
//}


void wifi_set_BT_status(int status)// 1: start 0: stop
{
#if 0
    ar6000_set_BT_status(status);   
#endif
}


BOOLEAN rtl8723_GetMAC(unsigned char hwmac[6])
{
    WIFI_ADDR_T addr = {0};
    uint32 ret = 0;
    unsigned char *pmac;
    unsigned char mac_zero[WIFI_NV_ADDR_LEN] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
    
    ret = WIFI_GetNvParam(&addr, NULL);
    pmac = addr.address;
    if (WIFI_RET_OK != ret 
        || (pmac[0] == 0xff) || (SCI_MEMCMP(pmac, mac_zero, WIFI_NV_ADDR_LEN) == 0))   
        //No default mac or defaut mac is 0xFF-FF-FF-FF-FF-FF or 0x00-00-00-00-00-00
    {
        //generate random mac
        int     random_num = 0;
        srand(SCI_GetTickCount());
        random_num = rand();        
        //high 3, stand for Realtek serial chip
        pmac[0] = 0x00;
        pmac[1] = 0xe0;
        pmac[2] = 0x4c;

        pmac[3] = (uint8)((random_num & 0x00FF0000) >> 16);
        pmac[4] = (uint8)((random_num & 0x0000FF00) >> 8);
        pmac[5] = (uint8)(random_num & 0x000000FF);

        //save into nv
        WIFI_SaveNvParam(&addr, NULL);
     }

    //copy return
    SCI_MEMCPY(hwmac, pmac, 6); 
    
    SCI_TRACE_LOW("wifi: para_GetMAC is %x-%x-%x-%x-%x-%x, ret=%d", hwmac[0], hwmac[1], hwmac[2], hwmac[3], hwmac[4], hwmac[5], ret);

    return TRUE;
}

LOCAL uint32 rtl8723SpiGpioIrq(uint32  param)
{
    p_rtl8723_priv_ops->wifi_interrupt_func();
    return TRUE;
}
unsigned char rtl8723_wifi_supplicant_turn_on(unsigned char from_mp)
{
    RTL_WIFISUPP_ON_RESULT_T Result;
    int i = 0;
    int ret = 0;
    RTL_TCPIP_NET_ID_T netid = 0;
    SCI_TRACE_LOW("&&&&&&&&&rtl8723_wifi_supplicant_turn_on()\n");
    rtl_memset(&Result, 0, sizeof(RTL_WIFISUPP_ON_RESULT_T));
    if (WIFI_Open(WIFI_PORT_TYPE_SPI, rtl8723SpiGpioIrq) != WIFI_RET_OK)
    {
        SCI_TRACE_LOW("&&&&&&&&&&&&Failed to Open SPI Port\n");
        //return FALSE;
        goto open_fail;
    }
    
    ret = p_rtl8723_priv_ops->wifi_hw_open_func(&netid);
    if (ret < 0) {
        //hw_open fail, we'd better do WIFI_Close at first jacky_20120913
        WIFI_Close();
        SCI_TRACE_LOW("rtl8723_wifi_supplicant_turn_on wifi_hw_open_func fail\n");
        //return FALSE;
        goto open_fail;
    }

    ret = p_rtl8723_priv_iperf_ops->wifi_support_iperf_func();
    if (ret < 0) {
        //iperf_entry fail, we'd better do wifi_hw_close&WIFI_Close at first jacky_20120913
        p_rtl8723_priv_ops->wifi_hw_close_func();
        WIFI_Close();
        SCI_TRACE_LOW("wifi_support_iperf_func fail\n");
        goto open_fail;
    }

    SCI_TraceLow("&&&&&rtl8723_wifi_supplicant_turn_on(): netid is 0x%x",netid);
    WIFI_interrupt_enable(TRUE);

    //spi_mac_init();
    if (!from_mp) {
        Result.wifi_on_result = RTL_WIFISUPP_RESULT_SUCC;
        Result.net_id = netid;
        Result.is_support_roam = 0;
        //result.is_support_protocol = pResult->is_support_protocol;
        for (i = 0; i < WIFISUPP_ENCRYP_PROTOCOL_MAX; i++)
        {
            Result.is_support_protocol[i] = FALSE;
        }

        //result.is_support_eap = pResult->is_support_eap;
        for (i = 0; i < WIFISUPP_WPA_EAP_TYPE_MAX; i++)
        {
            Result.is_support_eap[i] = FALSE;
        }

        //result.is_support_inner_eap = pResult->is_support_inner_eap;
        for (i = 0; i < WIFISUPP_INNER_CREDENTIAL_TYPE_MAX; i++)
        {
            Result.is_support_inner_eap[i] = FALSE;
        }
        rtl8723_supp_notifyOnCnf(&Result);
    }

    return TRUE;

open_fail:
    Result.wifi_on_result = RTL_WIFISUPP_RESULT_FAIL;
    rtl8723_supp_notifyOnCnf(&Result);
    return FALSE;
}
unsigned char rtl8723_wifi_supplicant_turn_off(unsigned char from_mp)
{
    RTL_WIFISUPP_OFF_RESULT_T Result;
    
    WIFI_interrupt_enable(FALSE);
    p_rtl8723_priv_ops->wifi_hw_close_func();
    WIFI_Close();

    if (!from_mp) {
        Result.wifi_off_result = RTL_WIFISUPP_RESULT_SUCC;
        rtl8723_supp_notifyOffCnf(&Result);
    }

    return TRUE;
}

unsigned char rtl8723_wifi_supplicant_scan_proc(RTL_WIFISUPP_SCAN_REQ_INFO_T *scanReqInfo)
{
    int ret = 0;
    RTL_WIFISUPP_RESULT_E result = RTL_WIFISUPP_RESULT_SUCC;
    ret = p_rtl8723_priv_ops->wifi_scan_proc_func(scanReqInfo);
    if (ret == -1) {
        result = RTL_WIFISUPP_RESULT_FAIL;
        rtl8723_supp_notifyScanCnf(&result);
    }
    return TRUE;
}

unsigned char rtl8723_wifi_supplicant_connect_proc(RTL_WIFISUPP_SSID_CONFIG_T* connectInfo)
{
    int ret = 0;
    ret = p_rtl8723_priv_ops->wifi_connect_req_func(connectInfo);
    return ret;
}
unsigned char rtl8723_wifi_supplicant_disconnect_proc(RTL_WIFISUPP_DISCONNECT_REQ_INFO_T* disconnectInfo)
{
    int ret = 0;
    ret = p_rtl8723_priv_ops->wifi_disconnect_req_func(disconnectInfo);
    return ret;
}
/*---------------------------------------------------------------------*/
/* mmi -- wifi_supplicant*/
unsigned char rtl8723_wifi_on()
{
    //SCI_TRACE_LOW:"&&&&&&&&&rtl8723_wifi_on()\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_900_112_2_18_0_36_18_2231,(uint8*)"");
    
