Jakes-Fu/ZW217_W19_V4.1_yisai/MS_Customize/source/product/driver/wifi/rtl8723/rtl8723_wifi_adapter.c
    return rtl8723_wifi_supplicant_turn_on(0);
}

unsigned char rtl8723_wifi_off()
{
    //RTL_WIFISUPP_OFF_RESULT_T Result;
    //SCI_TRACE_LOW:"&&&&&&&&&rtl8723_wifi_off()\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_908_112_2_18_0_36_18_2232,(uint8*)"");
    return rtl8723_wifi_supplicant_turn_off(0);
}

unsigned char rtl8723_wifi_scan(WIFISUPP_SCAN_REQ_INFO_T* scan_info_ptr)
{
    RTL_WIFISUPP_SCAN_REQ_INFO_T scanReqInfo;

    rtl_memset(&scanReqInfo,0,sizeof(RTL_WIFISUPP_SCAN_REQ_INFO_T));
    rtl_memcpy(&scanReqInfo, scan_info_ptr,sizeof(RTL_WIFISUPP_SCAN_REQ_INFO_T));
    return rtl8723_wifi_supplicant_scan_proc(&scanReqInfo);
}

unsigned char rtl8723_wifi_connect(WIFISUPP_SSID_CONFIG_T *connect_info_ptr)
{
    //SCI_TRACE_LOW:"&&&&&&&&&rtl8723_wifi_connect()\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_923_112_2_18_0_36_18_2233,(uint8*)"");
    return rtl8723_wifi_supplicant_connect_proc((RTL_WIFISUPP_SSID_CONFIG_T*)connect_info_ptr);
}

unsigned char rtl8723_wifi_disconnect(WIFISUPP_DISCONNECT_REQ_INFO_T *disconnect_info_ptr)
{
    //SCI_TRACE_LOW:"&&&&&&&&&rtl8723_wifi_disconnect()\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_929_112_2_18_0_36_18_2234,(uint8*)"");
    return rtl8723_wifi_supplicant_disconnect_proc(disconnect_info_ptr);
}

void rtl8723_handle_cus_msg(uint32 msg_id, void *msg_body_ptr)
{
    //SCI_TRACE_LOW:"&&&&&&&&&rtl8723_handle_cus_msg()\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_935_112_2_18_0_36_18_2235,(uint8*)"");
}

unsigned char rtl8723_get_connection_info(WIFISUPP_SCAN_AP_INFO_T *connection_info_ptr)
{
    //SCI_TRACE_LOW:"&&&&&&&&&rtl8723_get_connection_info()\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_940_112_2_18_0_36_18_2236,(uint8*)"");
    return 0;
}

unsigned int rtl8723_getThread_Identify(void)
{
    //SCI_TRACE_LOW:"&&&&&&&&&para_getThread_Identify()\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_946_112_2_18_0_36_18_2237,(uint8*)"");
    return 0;
    //return SCI_IdentifyThread();
}

/*------------------------------------------------------------------------------*/
/*----------------------- EUT functions--------------------------*/

#define RTL_EUT_TX_PKT_SINE    "sine"
#define RTL_EUT_TX_PKT_FRAME "frame"
#define RTL_EUT_TX_PKT_TX99    "tx99"
#define RTL_EUT_TX_PKT_TX100   "tx100"
#define RTL_EUT_TX_PKT_OFF "off"
#define RTL_EUT_RX_PKT_PROMIS      "promis"
#define RTL_EUT_RX_PKT_FILTER      "filter"
#define RTL_EUT_RX_PKT_REPORT      "report"
#define RTL_EUT_RX_PKT_OFF     "off"


#define RTL_EUT_TX_PKT_SIZE    1500    //[32-1500]
#define RTL_EUT_TX_PATTERN 1   //0: all zeros; 1: all ones; 2: repeating 10; 3: PN7; 4: PN9; 5: PN15
int g_wifi_eut_mode =0;
unsigned int g_rx_total_packets = 0;
unsigned int g_rx_err_packets = 0;

unsigned char wifi_eut_setmac(unsigned char* mac_addr)
{
    char str[6]={0};
    char i = 0;

    //sprintf(str,"macaddr=%x:%x:%x:%x:%x:%x\n", 
    //  mac_addr[0],mac_addr[1],mac_addr[2],
    //  mac_addr[3],mac_addr[4],mac_addr[5]);
    
    //SCI_TraceLow(":%s str = %s \n",__func__, str);
    for (i = 0; i  < 6; i++)
        str[i] = mac_addr[i];
    
        return (unsigned char)p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_SET_MACADDR](str);
}

int rtl8723_set_eut_rxtx_channel(int channel)
{
#if 1
    char str[128]={0};

    sprintf(str,"channel=%x\n", channel);
    
    //SCI_TraceLow:":%s(%d) str = %s \n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_993_112_2_18_0_36_18_2238,(uint8*)"sds",__func__,channel, str);
    return p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_SET_CHANNEL](str);
#endif
}

int rtl8723_set_eut_tx_rate(long ratio)
{
#if 1
    char str[128]={0};

    sprintf(str,"rate=%d\n", ratio);

    //SCI_TraceLow:":%s(%d) str = %s\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1005_112_2_18_0_36_18_2239,(uint8*)"sds",__func__,ratio, str);
    return p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_SET_RATE](str);
#endif
}

int rtl8723_set_eut_tx_pwr(long pwr)
{
#if 1
    char str[128]={0};

    sprintf(str,"txpower=%d\n", pwr);

    //SCI_TraceLow:":%s(%d) str = %s\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1017_112_2_18_0_36_18_2240,(uint8*)"sds",__func__,pwr, str);
    return p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_TX_POWER](str);
#endif
}

unsigned char rtl8723_eut_set_TX_param(unsigned char on_off, int tx_packet_mode)
{
#if 1
    char tx_str[128]={0};
    if (g_wifi_eut_mode) {
        if (on_off) {
            switch (tx_packet_mode) {
            case 0: //FRAME
                sprintf(tx_str,"count=%d,pkt\n", 1000);
            break;

            case 1://TX99               
          sprintf(tx_str,"background,cs\n");
            break;

            case 2://TX100
                sprintf(tx_str,"background,ct\n");
            break;

            case 3://SINE
                 sprintf(tx_str,"background,stone\n");
            break;
            
            default:
                sprintf(tx_str,"background,sc\n");
            break;
            }

            //SCI_TraceLow:":%s(%s)\n"
            SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1050_112_2_18_0_36_18_2241,(uint8*)"ss",__func__,tx_str);
        }
        else
        {
            sprintf(tx_str,"stop\n");
            //SCI_TraceLow:":%s(%s)\n"
            SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1055_112_2_18_0_36_18_2242,(uint8*)"ss",__func__,tx_str);
        }
        p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_TX_PKT](tx_str);

    }
#endif
    return 0;
}


unsigned char rtl8723_eut_set_RX_param(int rx_command)
{
#if 1
    char rx_str[64]={0};
    if(g_wifi_eut_mode)
    {
        switch(rx_command)
        {
        case 1: //off
            sprintf(rx_str,"start\n");
            //SCI_TraceLow:":%s(%s)\n"
            SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1075_112_2_18_0_36_18_2243,(uint8*)"ss",__func__,rx_str);

        break;

        case 0: //on
            sprintf(rx_str,"stop\n");
            //SCI_TraceLow:":%s(%s)\n"
            SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1081_112_2_18_0_36_18_2244,(uint8*)"ss",__func__,rx_str);

        break;

        case 2: //clear
            sprintf(rx_str,"clear\n");
            //SCI_TraceLow:":%s(%s)\n"
            SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1087_112_2_18_0_36_18_2245,(uint8*)"ss",__func__,rx_str);

        break;

        default:
        break;
        }       
    }
    p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_SET_RX](rx_str);
#endif
    return 0;
}

unsigned char rtl8723_eut_get_RX_packets(unsigned long *tatal_packets_ptr, unsigned long *err_packets_ptr)
{
#if 1
    if(g_wifi_eut_mode)
    {
             char rx_str[128]={0};
         unsigned long rxok = 0;
         unsigned long rxfail = 0;

