Jakes-Fu/ZW217_W19_V4.1_yisai/MS_Customize/source/product/driver/wifi/rtl8723/rtl8723_wifi_adapter.c
            sprintf(rx_str,"rxreport\n");

            p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_QUERY_TRX](rx_str);

            sscanf(rx_str, "Rx OK:%d, CRC error:%d ", &rxok, &rxfail);
            if (tatal_packets_ptr != 0)
            {
                *tatal_packets_ptr = rxok + rxfail;
            }

            if (err_packets_ptr != 0)
            {
                *err_packets_ptr = rxfail;
            }
        }
#endif
    return 0;
}
#ifdef AMY_TODO
unsigned int eeprom_data_len = 1024;
unsigned char rtl8723_eut_get_cal_data(char* pBuf, unsigned int len)
{
    if (!pBuf)
        return 0;

    if (len != eeprom_data_len)
    {
        //SCI_TRACE_LOW:"length not right, should be %d\n"
        SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1136_112_2_18_0_36_18_2246,(uint8*)"d", eeprom_data_len);
        return 0;
    }
    
    rtl_memcpy(pBuf, eeprom_data, len);
    return 1;
}

unsigned char rtl8723_eut_update_cal_data(const char* pBuf, unsigned int len)
{
    if (!pBuf)
        return 0;

    if (len != eeprom_data_len)
    {
        //SCI_TRACE_LOW:"length not right, should be %d\n"
        SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1151_112_2_18_0_36_18_2247,(uint8*)"d", eeprom_data_len);
        return 0;
    }

    //verify checksum
    {
        uint16 original_checksum = 0;
        uint16        checksum;
        uint16        *ptr_crc = NULL;
        uint16        *ptr16_eeprom;
        uint32        i;
        uint32        eeprom_size = eeprom_data_len;


        eeprom_size = 1024;
        ptr_crc = (uint16 *)((uint8 *)pBuf + 0x04);

        //crc to be verified
        original_checksum = *ptr_crc;
        
        // Clear the crc
        *ptr_crc = 0;

        // Recalculate new CRC
        checksum = 0;
        ptr16_eeprom = (uint16 *)pBuf;
        for (i = 0;i < eeprom_size; i += 2)
        {
            checksum = checksum ^ (*ptr16_eeprom);
            ptr16_eeprom++;
        }
        checksum = 0xFFFF ^ checksum;
        *ptr_crc = checksum;
        if (original_checksum == checksum)
        {
            ath_TraceLow("[%s]check sum is right\n", __func__);
        }
        else
        {
            ath_TraceLow("[%s]check sum is wrong\n", __func__);
            return 0;
        }
    }
    rtl_memcpy(eeprom_data, pBuf, len);
    return 1;
}
#endif

int rtl8723_eut_custom_data(const uint* pBuf)
{
    int ret = 0;
	char *cpBuf = (char *) pBuf;
    ret = p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_CUSTOM](cpBuf);
    return ret;
}

#define  RTL_WIFI_WORK_MODE_NORMAL 0
#define  RTL_WIFI_WORK_MODE_TCMD 1

unsigned char rtl8723_set_eut_mode(unsigned char is_enter)
{
	int RTL_WIFI_WORK_MODE_DEFAULT = RTL_WIFI_WORK_MODE_NORMAL;
#if 1
    if(is_enter)
    {
        //SCI_TraceLow:"rtl8723_set_eut_mode enter =====>\n"
        SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1216_112_2_18_0_36_18_2248,(uint8*)"");
        RTL_WIFI_WORK_MODE_DEFAULT = RTL_WIFI_WORK_MODE_TCMD;
        rtl8723_wifi_supplicant_turn_on(1);
        p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_OPEN](NULL);
        g_wifi_eut_mode = 1;
    }
    else
    {
        //SCI_TraceLow:"rtl8723_set_eut_mode leave =====>\n"
        SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1224_112_2_18_0_36_18_2249,(uint8*)"");
        p_rtl8723_priv_ops->wifi_mp_handle[RTL_MP_CLOSE](NULL);
        rtl8723_wifi_supplicant_turn_off(1);
        RTL_WIFI_WORK_MODE_DEFAULT = RTL_WIFI_WORK_MODE_NORMAL;
        g_wifi_eut_mode = 0;
    }
#endif
    return 0;
}

char rtl8723_release_version[64] = "WIFI_RTL_1.0";
char * WIFI_GetVersion(void)
{   
    //SCI_TraceLow:"&&&&&&&&&&&&&WIFI_GetVersion: is %s\n"
    SCI_TRACE_ID(TRACE_TOOL_CONVERT,RTL8723_WIFI_ADAPTER_1237_112_2_18_0_36_18_2250,(uint8*)"s",rtl8723_release_version);
    return rtl8723_release_version;
}
void iperf_test_start(char* param)
{
}
#endif
